{
  "_id": "Fuelduty-CE930B",
  "formName": "Fuel Duty: notification to supply gas for use as fuel in road vehicles (C&E930B)",
  "description": "CE930B form",
  "developmentPhase": "beta",
  "emailTemplateId": "al_registration_confirmation",
  "authConfig": {
    "authModule": "hmrc"
  },
  "dmsSubmission": {
    "businessArea": "FinanceOpsCorpT",
    "classificationType": "BT-NRU-Environmental",
    "customerId": "${utrRepComp}",
    "dmsFormId": "ALREG"
  },
  "sections": [
    {
      "title": "About this form",
      "shortName": "About",
      "fields": [
        {
          "id": "generatedId_375f7761_de35_47fd_958b_44438846a124",
          "type": "info",
          "label": "Info",
          "infoText": "Use this form to notify an intention to send out, set aside or supply gas for use as fuel in a road vehicle.\nNotice 76 Excise duty on gas for use as fuel in road vehicles explains: \n• how excise duty is charged on gas for use as road fuel\n• the requirements which suppliers, producers, and users of this gas must meet.\n\nFor a copy, follow the link below and search for Notice 76 or phone the Excise Helpline on 0300 200 3700. \nHM Revenue & Customs homepage\nDetails of the premises\n\nWhen you return this form, you must attach the following information about the premises:\n• whether gas for road fuel is handled in bulk or in cylinders\n• the description and distinguishing marks of every place, tank or vessel from which gas is to be supplied or sent out for use as road fuel, and whether any gas is supplied or sent out from the same place, tank or vessel for use other than as road fuel\n• the description and distinguishing marks of every place, tank or vessel in which gas is to be set aside for use as road fuel\n• whether the gas is produced at the premises stated in this notification or is supplied to it from other premises. If the gas is supplied from other premises, whether the supplier has been or will be informed that the gas is for use as fuel in a road vehicle\n• the description and registration mark and number of each road vehicle, controlled or operated by the person giving this notification, which uses gas as fuel for its propulsion. If such a vehicle is constructed or adapted to be propelled by any other fuel, the description of this fuel and whether it is to be used in place of or at the same time as gas\n• details of how you propose to advise customers that the gas supplied has been charged with excise duty, and\n• how the quantity of gas is to be determined.",
          "infoType": "noformat"
        }
      ]
    },
    {
      "title": "Notification details",
      "fields": [
        {
          "id": "intention",
          "type": "choice",
          "label": "Is this a notification of intention to send out, set aside or supply gas for use as fuel in a road vehicle from the premises aside?",
          "choices": [
            "Send out",
            "Set aside",
            "Supply"
          ]
        },
        {
          "id": "nameNotify",
          "type": "text",
          "label": "Full name of person or company notifying an intention"
        },
        {
          "id": "ukBased",
          "type": "choice",
          "label": "Is this address in the UK?",
          "choices": [
            "Yes",
            "No"
          ]
        },
        {
          "id": "businessAddress",
          "type": "address",
          "label": "Address"
        }
      ]
    }
  ],
  "declarationSection": {
    "title": "Declaration",
    "fields": [
      {
        "id": "status",
        "type": "text",
        "label": "Status in the company"
      },
      {
        "id": "choice",
        "type": "choice",
        "label": "",
        "choices": [
          "I declare that the information given on this form is  correct and complete. If there are any changes to the details, I will advise HM Revenue & Customs, in writing, within seven days of the change."
        ]
      }
    ]
  },
  "acknowledgementSection": {
    "title": "Your registration has been submitted",
    "fields": [
      {
        "id": "ackPageInfoTop",
        "type": "info",
        "label": "",
        "infoText": "This is your last opportunity to print or save a PDF copy of your submitted registration.",
        "infoType": "noformat"
      },
      {
        "id": "ackPageInfoBottom",
        "type": "info",
        "label": "",
        "infoText": "You must check the guidance for this service on GOV.UK to see whether you need to fill in and send any additional forms to complete your registration (for example if your business is a partnership you must also fill in and send form AL2) if you haven't already done so.\n\nHMRC will send you a letter to confirm your registration details and return dates so that you can prepare your first Aggregates Levy return. \n\nReturns will normally cover a 3 month period but if you would like to apply for non-standard periods, such as monthly returns, or periods that match your VAT return periods, you can contact the HMRC Excise team on enquiries.eeitts@hmrc.gsi.gov.uk\n\nIf you do not use a weighbridge you will also need to get in touch with the Excise team to agree an alternative method for weighing your aggregates.",
        "infoType": "noformat"
      }
    ]
  },
  "submitErrorUrl": "http://www.yahoo.co.uk",
  "submitSuccessUrl": "http://www.google.co.uk"
}